// Content for index.ejs template
module.exports = {
  title: '阔阔的个人主页',
  greeting: '你好 我是阔阔',
  intro: '我是一个程序员，我喜欢解决问题，喜欢看小说，喜欢弹Ukulele，也喜欢去世界各地的动物园看小动物。这里是我的个人主页。',
  aboutMe: '我是阔阔，工作是一名程序员，现在住在西雅图。<br/>我生在北京，在那里度过了十八年，大学四年离家去了东北。本科毕业后直接去了美国念Master，开始工作以后又从匹兹堡搬到了西雅图。我特别喜欢西雅图，这里不太冷也不太热，一年中九个月在下雨，但我也想回国，和在美国工作的很多中国程序员一样，内心总是摇摆不定。<br/>我很喜欢小动物， 也很喜欢动物园。加班压力大的时候，我常常会去西雅图的码头用薯条喂海鸥。空闲的时间我总想学一点儿跟工作或coding无关的事情。最近一直在学着弹乌克丽丽，希望有一天能弹到自己满意的水平，那时候再去学点儿别的。',
  aboutWork: 'Master毕业后，我就来了Amazon西雅图总部。实习期间在产品推荐组做算法的改进，实习结束后拿了return offer，加入Amazon社交购物部门，围绕客户内容作了一系列项目。一边工作一边学习，我开始意识到，一个组内大大小小十几个服务，如何高效可靠地整合起来，一直都是后端所面临的问题。那段时间开始阅读有关微服务架构（microservice）和响应式架构（reactive architecture）的书，自己对Amazon的Service Oriented Architecture开始有了更进一步的理解。<br/>在Amazon做开发，有机会大量接触使用AWS的云服务。第一次尝试用Lambda解决生产问题的时候，我意识到以Lambda为代表的Function-as-a-Service服务会是将来的趋势：API的粒度会被进一步细分；无状态的计算模型会迫使每一个Lambda函数的代码逻辑进一步简化；传统后端框架会显得过于臃肿，而被更轻量级的框架或库所取代；大多数性能要求不高的简单服务可以借助Lambda节省大量的资源；更重要的是，传统的后端应用开发难度会大大降低。我开始认真的担心，（在AI取代编程的工作之前）Serverless云服务会使得传统后端开发的很多工作变得不再重要。经过了三轮内部面试，我加入了AWS Lambda。',
  aboutPetProject: '虽然一直都在公司做后端开发的工作，但自己私下敲的东西只是出于兴趣，大部分跟工作没什么直接关系。',
  findMe: '你可以在这些地方找到我',
  contactMe: '直接和我联系'
}
